
# 파이썬의 주석은 샵(#)기호로 처리한다.
# 코드에 추가적인 설명이 필요할 때 주석을 사용한다.
# 샵(#) 이후부터 한 줄이 전부 주석으로 간주되며 파이썬 인터프리터는 주석을 코드로 인식하지 않는다.

a = 1
b = 2
c = 3

print(a + b + c) # 이 코드는 1+2+3의 결과를 출력하는 문장이다.

# 실행 단축키는 Ctrl + F11이다.
print("안녕안녕")
# print("잘가잘가")    # Ctrl + / : 주석처리
print("메롱메롱")

'''
여러 줄 주석은 삼중 따옴표로 처리한다.
이 안에 갇힌 모든 내용들은 일괄적으로 주석처럼 간주된다.
'''

# 파이썬에서는 불필요한 들여쓰기 공백은 에러를 유발한다. (IndentationError)
        # print("헬로!") (x)
        
# 파이썬에서는 문장의 끝에 세미콜론을 사용할 수는 있지만 권장하지는 않는다.
print(1 + 23); print(22 + 18)

# 파이썬의 모든 명령은 대/소문자를 구분한다.
# PRINT("안녕") (x)


